/*-------------------------------------------------------*/
/* theme.h	( NTHU CS MapleBBS Ver 3.10 )		         */
/*-------------------------------------------------------*/
/* target : custom theme				                 */
/* create : 09/07/28				 	                 */
/* update : 17/07/26  				 	                 */
/*-------------------------------------------------------*/


#ifndef	_THEME_H_
#define	_THEME_H_

/* ----------------------------------------------------- */
/* ¼È¦s°Ï				 */
/* ----------------------------------------------------- */

#define NEWMAILMSG "\033[41;37;5m ¶l®t½Ä¶i¨Ó¤F! \033[0;1;33;44m"
#define NEWPASSMSG "\033[42;37;5m ¦¬¨ì¯«¯µ¯d¨¥! \033[0;1;33;44m"

#define ICON_GAMBLED_BRD        "\033[1;31m½ä\033[m"    /* Á|¦æ½ä½L¤¤ªº¬ÝªO */
#define ICON_VOTED_BRD          "\033[1;33m§ë\033[m"    /* Á|¦æ§ë²¼¤¤ªº¬ÝªO */

//¤U¤@¦¸±À¤å®É¶¡­­¨î
#define NEXTPUSHTIME 15 

/* ----------------------------------------------------- */
/* °ò¥»ÃC¦â©w¸q¡A¥H§Q¤¶­±­×§ï				 */
/* ----------------------------------------------------- */

#define ANSIRESET	"\033[m"	    /* ²×¤îÃC¦â */

#define COLOR1		"\033[34;46m"	/* footer/feeter ªº«e¬qÃC¦â */
#define COLOR2		"\033[31;47m"	/* footer/feeter ªº«á¬qÃC¦â */
#define COLOR3		"\033[30;47m"	/* neck ªºÃC¦â */
#define COLOR4		"\033[1;44m"	/* ¥ú´Î ªºÃC¦â */
#define COLOR5		"\033[34;47m"	/* more ÀÉÀYªº¼ÐÃDÃC¦â */
#define COLOR6		"\033[37;44m"	/* more ÀÉÀYªº¤º®eÃC¦â */
#define COLOR7		"\033[0m"	    /* §@ªÌ¦b½u¤WªºÃC¦â */


/* ----------------------------------------------------- */
/* ¨Ï¥ÎªÌ¦W³æÃC¦â					 */
/* ----------------------------------------------------- */

#define         COLOR_PAL       "\033[1;32m"
#define         COLOR_BAD       "\033[1;31m"
#define         COLOR_CLOAK     "\033[1;35m"
#define         COLOR_BOTH      "\033[1;36m"
#define         COLOR_OPAL      "\033[1;33m"
#define		    COLOR_BOARDPAL	"\033[36m"

/* ----------------------------------------------------- */
/* ¿ï³æ¦ì¸m						 */
/* ----------------------------------------------------- */



/* ----------------------------------------------------- */
/* °T®§¦r¦ê¡G*_neck() ®Éªº necker ³£§ì¥X¨Ó©w¸q¦b³o	 */
/* ----------------------------------------------------- */

#define NECKBOARD "[¡ö]¥D¿ï³æ [¡÷]¾\\Åª [¡ô¡õ]¿ï¾Ü [c]½g¼Æ [y]¸ü¤J [/]·j´M [s]¬ÝªO [h]»¡©ú\n\
[30;47m  %-7s¬Ý  ªO            %-33s¤H®ð ªO    ¥D     [m"

#define NECKGEM1 "\
[¡ö]Â÷¶} [¡÷]ÂsÄý [f]¼Ò¦¡ [C]¼È¦s [F]Âà±H [Z]¤U¸ü [h]»¡©ú   "

#define NECKGEM2 "\033[44m\
  ½s¸¹     ¥D              ÃD                            [½s      ¿ï] [¤é  ´Á]\033[m"

#define NECKPOST "\
[¡ö]Â÷¶} [¡÷]¾\\Åª [^P]µoªí [b]³Æ§Ñ¿ý [d]§R°£ [V]§ë²¼ [TAB]ºëµØ°Ï [h]elp\n\
\033[30;47m  ½s¸¹    ¤é ´Á  §@  ªÌ       ¤å  ³¹  ¼Ð  ÃD                                  \033[m"

#define NECKMAIL "\
[¡ö]Â÷¶} [¡÷,r]Åª«H [d]§R°£ [R]¦^«H [s]±H«H [x]Âà¶K [y]¸s²Õ¦^«H [h]»¡©ú\n\033[44m\
 ½s¸¹    ¤é ´Á  §@ ªÌ          «H  ¥ó  ¼Ð  ÃD                                 \033[m"
 
#define NECKVOTE "\
		 [¡ö]Â÷¶} [v]§ë²¼ [R]µ²ªG [E]­×§ï [^P]Á|¦æ [^Q]¬d¸ß/¤¤¤î/§ï´Á [h]»¡©ú\n\033[44m\
		 ½s¸¹  ¶}²¼¤é  ¥D¿ì¤H       §ë  ²¼  ©v  ¦®                                   \033[m"

#define NECKINNBBS	"[¡ö]Â÷¶} [^P]·s¼W [d]§R°£ [E]½s¿è [/]·j´M [Enter]¸Ô²Ó\n" \
			COLOR3 "  ½s¸¹            ¤º         ®e%*s                                               \033[m"


// cache.101119

#define NECKER_VOTE     "[¡ö]Â÷¶} [R]µ²ªG [^P]Á|¦æ [E]­×§ï [V]¹wÄý [^Q]§ï´Á [o]¦W³æ [h]»¡©ú\n" \

#define NECKER_VOTEALL  "[¡ô/¡õ]¤W¤U [PgUp/PgDn]¤W¤U­¶ [Home/End]­º§À [¡÷]§ë²¼ [¡ö][q]Â÷¶}\n" \


/* ----------------------------------------------------- */
/* °T®§¦r¦ê¡Gxo_foot() ®Éªº feeter ³£§ì¥X¨Ó©w¸q¦b³o      */
/* ----------------------------------------------------- */


#define FOOTER_POST	\
COLOR1 " ¤å³¹¿ïÅª " COLOR2 " (ry)¦^À³ (=\\[]<>-+;'`)¥DÃD (|?QA)·j´M¼ÐÃD§@ªÌ (kj)¤W¤U½g (C)¼È¦s   "

#define FOOTER_MORE	\
COLOR1 " ÂsÄý P.%d (%d%%) " COLOR2 " (h)»¡©ú [PgUp][PgDn][0][$]²¾°Ê (/n)·j´M (C)¼È¦s (¡öq)µ²§ô "


#define FEETER_INNBBS	\
COLOR1 " Âà«H³]©w " COLOR2 " (¡ô/¡õ)¤W¤U (PgUp/PgDn)¤W¤U­¶ (Home/End)­º§À (¡ö)(q)Â÷¶}           "

#define FEETER_VOTEALL  \
	COLOR1 " Â§Ã«Â²Â¼Â¤Â¤Â¤? " COLOR2 " (Â¡Ã´/Â¡Ãµ)Â¤WÂ¤U (PgUp/PgDn)Â¤WÂ¤UÂ­Â¶ (Home/End)Â­ÂºÂ§? (Â¡Ã·)Â§Ã«Â²Â¼ (Â¡Ã¶)(q)?Ã·Â¶}  "

/* ----------------------------------------------------- */
/* ¯¸¥x¨Ó·½Ã±¦W						 */
/* ----------------------------------------------------- */

#ifndef ORIGIN_TAG

    #define ORIGIN_TAG \
"--\n" \
"\033[1;44;32m  ¢¨\033[0;32;44m¢©   \033[1;37m¡_¡_     \033[30m¢i¢v¢© ¢i¢v¢i ¢i¢v¢v ¢i¢v¢i ¢i¢g¢p ¢i   ¢i¢v¢i ¢i¢©¢i ¢i¢v\033[31m¡´ \033[m\n" \
"\033[1;32;44m¢¨\033[42m¢«\033[0;44;32m¢i¢©\033[1m¢¨\033[0;32;44m¢© \033[1;37m¡_¡_ \033[0;37;44m¢i  ¢i ¢i¢b¢« ¢i¢b¢b ¢i¢b¢i ¢p¢p¢p ¢i   ¢i¢b¢i ¢i¢ª¢i ¢i  ¢i \033[m\n" \
"\033[1;36;42m¹Ú¤§¤j¦a ¹G¹G£°¥| \033[37m¢i¢b¢« ¢i  ¢i ¢i¢b¢b ¢i  ¢i ¢p¢p¢p ¢i¢b ¢i  ¢i ¢i  ¢i ¢i¢b¢« \033[m\n" \
"\033[1;32m¡° Origin:\033[33m <bbs.ccns.ncku.edu.tw>  \033[31m¡» From:\033[36m %-34.34s \033[m\n"

#endif  // ORIGIN_TAG

#define MODIFY_TAG "\033[1;32m¡° Modify: \033[;1m<%s> \033[31;1m%s"

#define ANONYMOUS_TAG "--\n\033[1;32m¡° Origin: \033[33m%s \033[37m<%s> \033[m\n\033[1;31m¡» From: \033[36m%s\033[m\n"

#define EMAIL_TAG "\033[1;32m¡° E-mail: \033[36m%s\033[m\n"
/* ----------------------------------------------------- */
/* ¨ä¥L°T®§¦r¦ê						 */
/* ----------------------------------------------------- */

#endif				/* _THEME_H_ */
